In [1]:
import pandas as pd

In [2]:
data1 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],}

data2 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [3]:
df2

  key    Address Qualification
0  K0     Nagpur         Btech
1  K1     Kanpur           B.A
2  K2  Allahabad          Bcom
3  K3    Kannuaj        B.hons

In [4]:
# Perform merginig based on key

In [5]:
res = pd.merge(df1, df2, on='key')
res

  key    Name  Age    Address Qualification
0  K0     Jai   27     Nagpur         Btech
1  K1  Princi   24     Kanpur           B.A
2  K2  Gaurav   22  Allahabad          Bcom
3  K3    Anuj   32    Kannuaj        B.hons

In [6]:
# Merginig with different keys

In [7]:
import pandas as pd

data1 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K1', 'K0', 'K1'],
         'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],}

data2 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K0', 'K0', 'K0'],
         'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [8]:
res1 = pd.merge(df1, df2, on=['key1', 'key'])
res1

  key key1    Name  Age    Address Qualification
0  K0   K0     Jai   27     Nagpur         Btech
1  K2   K0  Gaurav   22  Allahabad          Bcom

In [9]:
# Joins using merginig

In [10]:
import pandas as pd

data1 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K1', 'K0', 'K1'],
         'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],}

data2 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K0', 'K0', 'K0'],
         'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [11]:
# Left join

In [12]:
res = pd.merge(df1, df2, how='left', on=['key', 'key1'])
res

  key key1    Name  Age    Address Qualification
0  K0   K0     Jai   27     Nagpur         Btech
1  K1   K1  Princi   24        NaN           NaN
2  K2   K0  Gaurav   22  Allahabad          Bcom
3  K3   K1    Anuj   32        NaN           NaN

In [13]:
# Right join

In [14]:
res1 = pd.merge(df1, df2, how='right', on=['key', 'key1'])
res1

  key key1    Name   Age    Address Qualification
0  K0   K0     Jai  27.0     Nagpur         Btech
1  K1   K0     NaN   NaN     Kanpur           B.A
2  K2   K0  Gaurav  22.0  Allahabad          Bcom
3  K3   K0     NaN   NaN    Kannuaj        B.hons

In [15]:
# Union

In [16]:
res2 = pd.merge(df1, df2, how='outer', on=['key', 'key1'])
res2

  key key1    Name   Age    Address Qualification
0  K0   K0     Jai  27.0     Nagpur         Btech
1  K1   K0     NaN   NaN     Kanpur           B.A
2  K1   K1  Princi  24.0        NaN           NaN
3  K2   K0  Gaurav  22.0  Allahabad          Bcom
4  K3   K0     NaN   NaN    Kannuaj        B.hons
5  K3   K1    Anuj  32.0        NaN           NaN

In [17]:
# Intersection

In [18]:
res3 = pd.merge(df1, df2, how='inner', on=['key', 'key1'])
res3

  key key1    Name  Age    Address Qualification
0  K0   K0     Jai   27     Nagpur         Btech
1  K2   K0  Gaurav   22  Allahabad          Bcom

In [19]:
# EDA ----> Exploratory Data Analysis

In [20]:
# (1). Descrete Data ---> We cannot dividie furthur in more specific  parts .
# Ex. fever(yes,no) , martial status(yes, no) , total number of employees in a office(500,501)
# (2). Continous Data  ---> We can divide frthur in more specific parts .
# Ex. date_of_birth , distance , weight , height

In [21]:
# (1). Univariate Analysis ---> Perform operation on single column .
# (2). Bivariate Analysis  ---> Perform operation on 2 columns .
# (3). Multivariate Analysis  ----> Perform operation on more than 2 columns

In [22]:
# Data Visualization Libraries
# Matplotlib
# Seaborn

In [25]:
df = pd.read_csv("titanic - titanic.csv")
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q

In [26]:
import matplotlib.pyplot as plt  #Visualization Library
import seaborn as sns  # matplotlib's updated version is seaborn .

ModuleNotFoundError: No module named 'matplotlib'

In [ ]:
# (1). Univariate Analysis

In [ ]:
df['Survived'].value_counts()

In [ ]:
sns.countplot(x = df['Survived'])

In [ ]:
df['Survived'].value_counts().plot(kind = 'pie' , autopct= "%.3f")

In [ ]:
df.head(3)

In [ ]:
df['Pclass'].value_counts().plot(kind = "bar")

In [ ]:
df['Pclass'].value_counts().plot(kind = "pie" , autopct="%.2f")

In [ ]:
###for Numerical data

In [ ]:
plt.hist(x = df['Age'])

In [ ]:
df['Fare'].isnull().sum()

In [ ]:
df['Fare'] = df['Fare'].fillna(df['Fare'].mean())

In [ ]:
plt.hist(x = df['Fare'])

In [ ]:
# (2). BoxPlot

# lower_fence
# 25% data
# 50% data (IQR) ---> Inter Quartile Range
# 75% data
# Upper_fence

In [ ]:
sns.boxplot(x = df['Age'])

In [ ]:
# sns.boxplot(x = df['Fare'])

In [ ]:
sns.distplot(x = df['Age'])

In [ ]:
sns.histplot(x = df['Age'])